"""
企业发放的奖金根据利润提成。利润(I)低于或等于10万元时，奖金可提10%；利润高于10万元，低于20万元时，低于10万元的部分按10%提成，
高于10万元的部分，可提成7.5%；20万到40万之间时，低于20万元的部分按7.5%提成，高于20万元的部分，可提成5%；40万到60万之间时，
低于40万元的部分按5%提成，高于40万元的部分，可提成3%；60万到100万之间时，低于60万元的部分按3%提成，高于60万元的部分，可提成1.5%，
高于100万元时，低于100万元的部分按1.5%提成，超过100万元的部分按1%提成，从键盘输入当月利润I，求应发放奖金总数？
@author hailin
@date 2020-05-03
"""
# 获取利润
profit = float(input("输入当月利润(万元):"))
# 公式计算
if profit > 100:
    bonus = (profit - 100) * 0.01 + 100 * 0.015
elif profit >= 60:
    bonus = (profit - 60) * 0.015 + 60 * 0.03
elif profit >= 40:
    bonus = (profit - 40) * 0.03 + 40 * 0.05
elif profit >= 20:
    bonus = (profit - 20) * 0.05 + 20 * 0.075
elif profit > 10:
    bonus = (profit - 10) * 0.075 + 10 * 0.1
else:
    bonus = profit * 0.1
# 显示结果
print("应发放奖金总数:", bonus, "万元")