"""
    选择语句 -- if else
        价值:
            在一定条件下,执行某些语句.
        语法:
            if 条件:
                满足条件执行的代码
            else:
                不满足条件执行的代码
    练习:exercise04

"""
# 如果有钱,就能取媳妇
# 否则,踏实学习

# print(input("你有钱吗?") == "有" or input("你有房吗?") == "有")
# print(input("你有房子吗?") == "有" and input("你有车子吗?") == "有")
# 缩进:4个空格     按TAB键

# 短路逻辑:一但结果确定，后面的语句将不再执行。
# 有一个满足就行
# if input("你有钱吗?") == "有" or input("你有房吗?") == "有":
# 都得满足
if input("你有房子吗?") == "有" and input("你有车子吗?") == "有":
    print("娶媳妇")
else:
    print("踏实学习")

"""
    在终端中输入性别
    根据性别显示:您好,先生.
               您好,女士.
"""