"""
练习1:创建三个字典,存储前三个地区疫情信息(名称,新增,现有,累计,治愈)
练习2:为以上三个字典,添加si亡信息
练习3:将第二个字典的新增人数设置为0,
练习4:打印第二个字典信息:
格式: xx新增xx,现有xx,累计xx,治愈xx,si亡xx
"""
# 创建三个字典,存储前三个地区疫情信息(名称,新增,现有,累计,治愈)
city_01 = {"疫情地区": "黑龙江", "新增": 0, "现有": 116, "累计": 944, "治愈": 815}
city_02 = {"疫情地区": "香港", "新增": 4, "现有": 80, "累计": 1044, "治愈": 960}
city_03 = {"疫情地区": "台湾", "新增": 1, "现有": 79, "累计": 440, "治愈": 355}
# 为以上三个字典,添加si亡信息
city_01["死亡"] = 13
city_02["死亡"] = 4
city_03["死亡"] = 6
# print(city_01,city_02,city_03)
# 将第二个字典的新增人数设置为0
city_02["新增"] = 0
# 打印第二个字典信息
str01=""
for k, v in city_02.items():
    str01 += (k+str(v))

print(str01)